Repository: apkoponen/op-payment-service-give
Catalog: languages/give-op_payment_service-*.po
Languages: fi

source: Phone
fi: Puhelin

source: Enter only phone number.
fi: Anna vain puhelinnumero.

source: Phone:
fi: Puhelin:

source: Payment Method Label
fi: Maksutavan tunniste

source: Payment method label will be appear on frontend.
fi: Maksutavan nimi näkyy julkisella sivustolla.

source: Merchant ID
fi: Kauppiastunnus

source: The Merchant ID provided by OP Payment Service.
fi: Kauppiastunnus, OP Payment Service -palvelusta.

source: Merchant Secret
fi: Salainen avain

source: The Merchant Secret provided by OP Payment Service.
fi: Salainen avain, OP Paymen Service -palvelusta.

source: Show Phone Field
fi: Näytä puhelinkenttä

source: Enable this setting if you want to show phone field on donation form.
fi: Ota tämä asetus käyttöön, jos haluat näyttää puhelinkentän lahjoituslomakkeessa.

source: Enabled
fi: Käytössä

source: Disabled
fi: Ei käytössä

source: OP Payment Service Gateway
fi: OP Payment Service Maksupääte

source: Settings
fi: Asetukset

source: Nonce verification has failed.
fi: Nonce-vahvistus on epäonnistunut.

source: Error
fi: Virhe

source: Payment Error
fi: Maksuvirhe

source: Payment creation failed before process OP Payment Service gateway. Payment data: %s
fi: Maksun luominen epäonnistui ennen OP Payment Service prosessia. Maksutiedot: %s

source: An error occurred loading the payment providers.
fi: Virhe ladattaessa maksutapoja.

source: The payment provider was not chosen.
fi: Maksutapaa ei valittu.

source: This is a donation payment for %s
fi: Tämä on lahjoitusmaksu UskoTV:lle: %s

source: An error occurred validating the payment.
fi: Virhe maksun tarkistuksessa.

source: An error occurred validating the payment request.
fi: Virhe maksupyynnön tarkistuksessa.

source: An error occurred performing the payment request.
fi: Virhe maksupyynnön tekemisessä.

source: OP Payment Service payment completed (Payment id: %s)
fi: OP Payment Service maksu onnistui (Maksu id: %s)

source: OP Payment Service payment cancelled (Payment id: %s)
fi: OP Payment Service maksu peruutettu (Maksu id: %s)

source: OP Payment Service payment failed (Payment id: %s)
fi: OP Payment Service maksu epäonnistui (Maksu id: %s)

source: OP Payment Service Error
fi: OP Payment Service Virhe

source: The OP Payment Service Gateway returned an error while charging a donation.
fi: OP Payment Service palautti virheen veloitettaessa lahjoituksen.

source: Details: %s
fi: Tiedot: %s

source: Mobile payment methods
fi: Mobiilimaksutavat

source: Bank payment methods
fi: Pankkimaksutavat

source: Card payment methods
fi: Korttimaksutavat

source: Invoice and instalment payment methods
fi: Lasku- ja osamaksutavat

source: Process Donations with the OP Payment Service
fi: Käsittele lahjoitus OP Payment Servicellä

source: Select payment method
fi: Valitse maksutapa

source: Redirecting you to the payment provider
fi: Ohjaamme sinut maksunvälittäjälle

source: Redirecting... If nothing happens in a few seconds, click the button below.
fi: Ohjataan eteenpäin… Jos mitään ei tapahdu muutamassa sekunnissa, napsauta alla olevaa painiketta.

source: Submit
fi: Lähetä
